In [1]:
import datafaucet as dfc

In [2]:
from datetime import date
d = date.today()
from datafaucet.spark import utils
utils.get_type(type(d))

DateType

In [3]:
# start the engine
project = dfc.project.load()

created SparkEngine
Init engine "spark"
Connecting to spark master: local[*]
Engine context spark:2.4.4 successfully started

In [4]:
spark = dfc.context()

In [5]:
df = spark.range(1000)

In [6]:
from datafaucet.spark import utils
utils.fake('date_between', start_date="-30y", end_date="today")

df = (df
    .cols.create('g').randint(0,5)
    .cols.create('i').rand(0,1)
    .cols.create('n').randn(0,1)
    .cols.create('c').randchoice([True, False])
    .cols.create('f').fake('first_name')
    .cols.create('y').fake('name')
    .cols.create('d').fake('date_between', start_date="-30y", end_date="today")
    .cols.create('t').fake('past_datetime', start_date="-1d")
    .cols.create('ip').fake('ipv4_public')      
)

In [7]:
df.data.grid(5)

,id,g,i,n,c,f,y,d,t,ip
0,0,4,0.593444,-0.852090,False,Kristen,Joel Byrd,2011-06-25,2019-11-09 23:45:20,101.61.71.223
1,1,1,0.775122,-2.695012,True,Mark,Jeffrey Robinson,1990-06-03,2019-11-10 08:13:25,27.100.163.16
2,2,3,0.468253,0.240551,False,Wyatt,Andrew Sims,1999-09-24,2019-11-10 02:41:37,125.82.236.167
3,3,1,0.344297,-1.031398,True,Joel,Tammy Lowery,1994-06-07,2019-11-09 15:52:56,122.144.10.251
4,4,3,0.429483,0.692709,False,Zachary,Shelia Rollins,2016-01-04,2019-11-10 04:43:32,11.129.219.138

In [10]:
from pyspark.sql import functions as F
df.cols.agg(['type', 'count', 'one', 'null'], stack='_0').data.grid()

['colname', 'count', 'one', 'null', 'type']

  colname  count                  one  null       type
0      id   1000                    0     0     bigint
1       g   1000                    4     0        int
2       i   1000   0.5934444736287345     0     double
3       n   1000  -0.8520896602564431     0     double
4       c   1000                false     0    boolean
5       f   1000             Nicholas     0     string
6       y   1000          Jeffrey Lee     0     string
7       d   1000           2004-03-27     0       date
8       t   1000  2019-11-09 21:06:10     0  timestamp
9      ip   1000       169.242.86.252     0     string

In [ ]:
# hashing, obscure, encrypt, mask